In [1]:
#加载所需的库
import numpy as np
import pandas as pd

In [4]:
#关于泰坦尼克号的任务，我们就使用这个数据
text = pd.read_csv('train_chinese.csv')
text.head()

,Unnamed: 0,乘客ID,是否幸存,仓位等级,姓名,性别,年龄,兄弟姐妹个数,父母子女个数,船票信息,票价,客舱,登船港口
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
#自己构建一个都为数字的DataFrame数据
frame = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                     index=['2', '1','3', '0'], 
                     columns=['d', 'a', 'b', 'c'])
frame

    d   a   b   c
2   0   1   2   3
1   4   5   6   7
3   8   9  10  11
0  12  13  14  15


pd.DataFrame() ：创建一个DataFrame对象

np.arange(8).reshape((4, 4)) : 生成一个二维数组（4*4）,第一列：0，1，2，3 第二列：4，5，6，7

index='2, 1, 0 , 3' ：DataFrame 对象的索引列

columns='d', 'a', 'b', 'c' ：DataFrame 对象的索引行

In [5]:
#将你构建的DataFrame中的数据根据某一列，升序排列
frame.sort_values(by='c')

    d   a   b   c
2   0   1   2   3
1   4   5   6   7
3   8   9  10  11
0  12  13  14  15

可以看到sort_values这个函数中by参数指向要排列的列，ascending参数指向排序的方式（升序还是降序）

In [3]:
# 让行索引升序排序
frame.sort_index()

    d   a   b   c
0  12  13  14  15
1   4   5   6   7
2   0   1   2   3
3   8   9  10  11

In [4]:
# 让行索引降序排序
frame.sort_index(ascending=False)

    d   a   b   c
3   8   9  10  11
2   0   1   2   3
1   4   5   6   7
0  12  13  14  15

In [5]:
# 让列索引升序排序
frame.sort_index(axis=1)

    a   b   c   d
2   1   2   3   0
1   5   6   7   4
3   9  10  11   8
0  13  14  15  12

In [7]:
# 让列索引降序排序
frame.sort_index(axis=1,ascending=False)

    d   c   b   a
2   0   3   2   1
1   4   7   6   5
3   8  11  10   9
0  12  15  14  13

In [6]:
# 让任选两列数据同时降序排序
frame.sort_values(by=['a', 'c'])

    d   a   b   c
2   0   1   2   3
1   4   5   6   7
3   8   9  10  11
0  12  13  14  15